newwms_gift/src/InformationRegisters/СоответствиеКонтрагентовИОсобенностей/СоответствиеКонтрагентовИОсобенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеКонтрагентовИОсобенностей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПризнакИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Особенность</name>
    <type>
      <types>CatalogRef.ОсобенностиКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/CommonModules/ОбработчикОсобенностейКонтрагентов/Module.bsl
// Процедура - Центральный обработчик особенностей
//
// Параметры:
//  ОбъектПроверки	 - Произвольный - 
//  Контрагент       - СправочникСсылка.Контрагенты - 
//  ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов -
//  Организация      - СправочникСсылка.Организация -
//  Дата             - Дата -
//  Отказ			 - Булево - 
//  ОписаниеОшибки	 - Строка - 
//
Процедура  ЦентральныйОбработчикОсобенностей (ОбъектПроверки,Контрагент,ДоговорКонтрагента=Неопределено,Дата,Организация,Отказ,ОписаниеОшибки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.Период КАК Период,
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.Организация КАК Организация,
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.Контрагент КАК Контрагент,
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.Особенность КАК Особенность,
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.ПризнакИспользования КАК ПризнакИспользования
		|ИЗ
		|	РегистрСведений.СоответствиеКонтрагентовИОсобенностей.СрезПоследних(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И Организация = &Организация) КАК СоответствиеКонтрагентовИОсобенностейСрезПоследних
		|ГДЕ
		|	СоответствиеКонтрагентовИОсобенностейСрезПоследних.ПризнакИспользования
		|	И ВЫБОР
		|			КОГДА &ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
		|				ТОГДА СоответствиеКонтрагентовИОсобенностейСрезПоследних.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ИНАЧЕ СоответствиеКонтрагентовИОсобенностейСрезПоследних.ДоговорКонтрагента = &ДоговорКонтрагента
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЦентральныйОбработчикОсобенности(ОбъектПроверки,ВыборкаДетальныеЗаписи.Особенность,Отказ,ОписаниеОшибки);
	КонецЦикла;
	
	 
КонецПроцедуры


// Процедура - Центральный обработчик особенности
//
// Параметры:
//  ОбъектПроверки	 - Произвольный	- 
//  Особенность		 - СправочникСсылка.ОсобенностиКонтрагентов	 - 
//  Отказ			 - Булево - 
//  ОписаниеОшибки	 - Строка - 
//
Процедура ЦентральныйОбработчикОсобенности(ОбъектПроверки,Особенность,Отказ,ОписаниеОшибки="") Экспорт 
	Если Особенность.АлгоритмПроверки.Наименование="ПроверкаКоличестваСерийВНаборке" Тогда
		Если  ТипЗнч(ОбъектПроверки) = Тип("ДокументОбъект.итWMSНаборка") Тогда 
			ПроверкаНаборкиНаКоличествоСерий(ОбъектПроверки,Особенность,Отказ,ОписаниеОшибки);
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если Особенность.АлгоритмПроверки.Наименование="КонтрольКоличестваСерийНаборкиПоКарточкеНоменклатуры" Тогда
		Если  ТипЗнч(ОбъектПроверки) = Тип("ДокументОбъект.итWMSНаборка") Тогда 
			ПроверкаНаборкиНаКоличествоСерийПоНоменклатуре(ОбъектПроверки,Особенность,Отказ,ОписаниеОшибки);
		иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
    

	
КонецПроцедуры
Процедура ПроверкаНаборкиНаКоличествоСерийПоНоменклатуре(ОбъектПроверки,Особенность,Отказ,ОписаниеОшибки)
	  КоличествоДопустимыхСерий=ПоискЗначенийПоНаименованию(Особенность,"Количество серий");
	Если КоличествоДопустимыхСерий=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ТаблицаТоварыНаборка=ОбъектПроверки.Товары.Выгрузить();
	Если ТаблицаТоварыНаборка.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаборки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТоварыНаборки.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтСерии
		|ИЗ
		|	&ТоварыНаборки КАК ТоварыНаборки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтСерии.СерияНоменклатуры) КАК СерияНоменклатуры,
		|	ВтСерии.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтСерии КАК ВтСерии
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСерии.Номенклатура";
	
	Запрос.УстановитьПараметр("ТоварыНаборки",ТаблицаТоварыНаборка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СерияНоменклатуры>КоличествоДопустимыхСерий Тогда 
			Если не ОбъектПроверки.ИгнорироватьОшибкиСерии Тогда 
			Отказ=Истина;
			КонецЕсли;
			ОписаниеОшибки=ОписаниеОшибки+"Превышено допустимое количество серий в наборке на "+ Строка(ВыборкаДетальныеЗаписи.СерияНоменклатуры-КоличествоДопустимыхСерий);
		КонецЕсли;
	КонецЦикла;

	КонецПроцедуры
Процедура ПроверкаНаборкиНаКоличествоСерий(ОбъектПроверки,Особенность,Отказ,ОписаниеОшибки)
	КоличествоДопустимыхСерий=ПоискЗначенийПоНаименованию(Особенность,"Количество серий");
	Если КоличествоДопустимыхСерий=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ТаблицаТоварыНаборка=ОбъектПроверки.Товары.Выгрузить();
	Если ТаблицаТоварыНаборка.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаборки.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ВтСерии
		|ИЗ
		|	&ТоварыНаборки КАК ТоварыНаборки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтСерии.СерияНоменклатуры) КАК СерияНоменклатуры
		|ИЗ
		|	ВтСерии КАК ВтСерии";
	
	Запрос.УстановитьПараметр("ТоварыНаборки",ТаблицаТоварыНаборка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СерияНоменклатуры>КоличествоДопустимыхСерий Тогда 
			Если не ОбъектПроверки.ИгнорироватьОшибкиСерии Тогда 
			Отказ=Истина;
			КонецЕсли;
			ОписаниеОшибки=ОписаниеОшибки+"Превышено допустимое количество серий в наборке на "+ Строка(ВыборкаДетальныеЗаписи.СерияНоменклатуры-КоличествоДопустимыхСерий);
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры



Функция ПоискЗначенийПоНаименованию(Особенность,Наименование)
Для Каждого стр из Особенность.ЗначенияПараметров Цикл 
		Если стр.Параметр.Наименование=Наименование Тогда 
			Возврат стр.Значение;
		КонецЕсли;
	КонецЦикла;
   Возврат Неопределено;
	КонецФункции
